app/views/posts/_form.html.erb

    <%= f.label :event_id %><br>
    <%= collection_select(:event, :event_id, Event.all, :id, :title) %>
---
SELECT "events".* FROM "events"