app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "tags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "schoolflower"], ["description", "lala"], ["tags", "t1"], ["created_at", "2015-04-24 23:28:25.216531"], ["updated_at", "2015-04-24 23:28:25.216531"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save