app/controllers/posts_controller.rb

  def create
    success = false
    notice = ""
    if current_user != nil
      @post = Post.new(post_params)
      @post.event.post_count += 1
      @post.event.save!
---
INSERT INTO "posts" ("event_id", "text_content", "vote_count", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["event_id", 1], ["text_content", "1"], ["vote_count", 1], ["date", "2015-04-24 23:28:00.000000"], ["created_at", "2015-04-24 23:29:16.658289"], ["updated_at", "2015-04-24 23:29:16.658289"]]